In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass 
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

In [2]:
password = getpass.getpass()

········

Create a query or queries to extract the information you think may be relevant for building the prediction model. 
It should include some film features and some rental features. Use the data from 2005.

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
query = """select f.title, p.amount, f.release_year, f.language_id, f.rental_duration, f.rating, f.length, r.rental_date,
 r.return_date, r.inventory_id, r.customer_id from sakila.payment as p
join rental as r on p.rental_id = r.rental_id
join inventory as i
on r.inventory_id = i.inventory_id
join film as f 
on i.film_id = f.film_id
join film_category as fc
on i.film_id = fc.film_id
join category as c
on fc.category_id = c.category_id
where r.rental_date>2005"""

data = pd.read_sql_query(query, engine)
data.head()

,title,amount,release_year,language_id,rental_duration,rating,length,rental_date,return_date,inventory_id,customer_id
0,AMADEUS HOLY,0.99,2006,1,6,PG,113,2005-08-02 01:16:59,2005-08-03 02:41:59,93,77
1,AMADEUS HOLY,0.99,2006,1,6,PG,113,2005-08-18 04:26:54,2005-08-23 06:40:54,93,39
2,AMADEUS HOLY,0.99,2006,1,6,PG,113,2005-06-20 20:35:28,2005-06-26 01:01:28,94,34
3,AMADEUS HOLY,3.99,2006,1,6,PG,113,2005-07-09 05:01:58,2005-07-18 08:17:58,94,254
4,AMADEUS HOLY,1.99,2006,1,6,PG,113,2005-07-30 08:02:39,2005-08-06 12:02:39,94,276

In [5]:
data.columns

Index(['title', 'amount', 'release_year', 'language_id', 'rental_duration',
       'rating', 'length', 'rental_date', 'return_date', 'inventory_id',
       'customer_id'],
      dtype='object')

Create a query to get the total amount of rentals in June for each film.

In [6]:
query1= """select f.title as movie_title, p.amount as total_amount_June, r.return_date  from sakila.payment as p
join rental as r on p.rental_id = r.rental_id
join inventory as i
on r.inventory_id = i.inventory_id
join film as f 
on i.film_id = f.film_id
WHERE return_date BETWEEN '2005-06-01' AND '2005-06-30'"""

data1 = pd.read_sql_query(query1, engine)
data1.head()

        movie_title  total_amount_June         return_date
0     GRADUATE LORD               3.99 2005-06-01 22:12:39
1     LOVE SUICIDES               4.99 2005-06-03 01:43:41
2   IDOLS SNATCHERS               6.99 2005-06-02 04:33:21
3      WHALE BIKINI               8.99 2005-06-02 20:56:02
4  PELICAN COMFORTS               9.99 2005-06-03 03:30:22

In [7]:
Data_grouped=data1[['total_amount_June', 'movie_title']].groupby('movie_title').sum()
Data_grouped

                   total_amount_June
movie_title
ACADEMY DINOSAUR                5.96
ADAPTATION HOLES                5.98
AFFAIR PREJUDICE               13.96
AFRICAN EGG                    12.97
AGENT TRUMAN                   34.95
...                              ...
YOUNG LANGUAGE                  0.99
YOUTH KICK                      3.99
ZHIVAGO CORE                    6.97
ZOOLANDER FICTION               9.97
ZORRO ARK                      36.94

[897 rows x 1 columns]

In [8]:
data1.shape

(3038, 3)

In [9]:
Data_grouped[Data_grouped.index=='GRADUATE LORD']

               total_amount_June
movie_title
GRADUATE LORD              13.96

In [10]:
Data_grouped[Data_grouped.index=='YOUNG LANGUAGE']

                total_amount_June
movie_title
YOUNG LANGUAGE               0.99

In [11]:
query2= """select f.title as movie_title, p.amount as total_amount_July, r.return_date  from sakila.payment as p
join rental as r on p.rental_id = r.rental_id
join inventory as i
on r.inventory_id = i.inventory_id
join film as f 
on i.film_id = f.film_id
WHERE return_date BETWEEN '2005-07-01' AND '2005-07-30'"""

data2 = pd.read_sql_query(query2, engine)
data2.head()

       movie_title  total_amount_July         return_date
0    HALF OUTFIELD               6.99 2005-07-01 01:09:17
1      CROW GREASE               0.99 2005-07-07 19:36:24
2      GRAPES FURY               4.99 2005-07-13 01:38:44
3        CORE SUIT               7.99 2005-07-13 17:18:33
4  MOTIONS DETAILS               2.99 2005-07-12 23:53:34

In [12]:
Data_grouped2=data2[['total_amount_July', 'movie_title']].groupby('movie_title').sum()
Data_grouped2

                   total_amount_July
movie_title
ACADEMY DINOSAUR                3.96
ACE GOLDFINGER                  4.99
ADAPTATION HOLES               11.96
AFFAIR PREJUDICE               24.94
AFRICAN EGG                    15.97
...                              ...
YOUNG LANGUAGE                  1.98
YOUTH KICK                      0.99
ZHIVAGO CORE                    1.98
ZOOLANDER FICTION              20.95
ZORRO ARK                      50.93

[953 rows x 1 columns]

In [13]:
Joined_june_july=Data_grouped.join(Data_grouped2)
Joined_june_july

                   total_amount_June  total_amount_July
movie_title
ACADEMY DINOSAUR                5.96               3.96
ADAPTATION HOLES                5.98              11.96
AFFAIR PREJUDICE               13.96              24.94
AFRICAN EGG                    12.97              15.97
AGENT TRUMAN                   34.95              23.96
...                              ...                ...
YOUNG LANGUAGE                  0.99               1.98
YOUTH KICK                      3.99               0.99
ZHIVAGO CORE                    6.97               1.98
ZOOLANDER FICTION               9.97              20.95
ZORRO ARK                      36.94              50.93

[897 rows x 2 columns]

In [14]:
Joined_june_july['Status']=Joined_june_july['total_amount_July']> Joined_june_july['total_amount_June']
Joined_june_july

                   total_amount_June  total_amount_July  Status
movie_title
ACADEMY DINOSAUR                5.96               3.96   False
ADAPTATION HOLES                5.98              11.96    True
AFFAIR PREJUDICE               13.96              24.94    True
AFRICAN EGG                    12.97              15.97    True
AGENT TRUMAN                   34.95              23.96   False
...                              ...                ...     ...
YOUNG LANGUAGE                  0.99               1.98    True
YOUTH KICK                      3.99               0.99   False
ZHIVAGO CORE                    6.97               1.98   False
ZOOLANDER FICTION               9.97              20.95    True
ZORRO ARK                      36.94              50.93    True

[897 rows x 3 columns]

In [15]:
Status=[]

for i in Joined_june_july['Status']:
#     print(i)
    if i ==True:
        Status.append('Yes')
    elif i==False:
        Status.append('No')
        
    else:
        pass
        
Joined_june_july['Status'] =Status     
Joined_june_july

                   total_amount_June  total_amount_July Status
movie_title
ACADEMY DINOSAUR                5.96               3.96     No
ADAPTATION HOLES                5.98              11.96    Yes
AFFAIR PREJUDICE               13.96              24.94    Yes
AFRICAN EGG                    12.97              15.97    Yes
AGENT TRUMAN                   34.95              23.96     No
...                              ...                ...    ...
YOUNG LANGUAGE                  0.99               1.98    Yes
YOUTH KICK                      3.99               0.99     No
ZHIVAGO CORE                    6.97               1.98     No
ZOOLANDER FICTION               9.97              20.95    Yes
ZORRO ARK                      36.94              50.93    Yes

[897 rows x 3 columns]

In [16]:
Joined_june_july

                   total_amount_June  total_amount_July Status
movie_title
ACADEMY DINOSAUR                5.96               3.96     No
ADAPTATION HOLES                5.98              11.96    Yes
AFFAIR PREJUDICE               13.96              24.94    Yes
AFRICAN EGG                    12.97              15.97    Yes
AGENT TRUMAN                   34.95              23.96     No
...                              ...                ...    ...
YOUNG LANGUAGE                  0.99               1.98    Yes
YOUTH KICK                      3.99               0.99     No
ZHIVAGO CORE                    6.97               1.98     No
ZOOLANDER FICTION               9.97              20.95    Yes
ZORRO ARK                      36.94              50.93    Yes

[897 rows x 3 columns]

In [29]:

# Split the data into training and testing sets
X = Joined_june_july.drop("Status", axis=1)
y = Joined_june_july["Status"]
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

# Train the logistic regression model
model = LogisticRegression()
model.fit(X_train, y_train)

# Make predictions on the test data
y_pred = model.predict(X_test)

# Evaluate the model using accuracy
accuracy = accuracy_score(y_test, y_pred)
print("Accuracy: ", accuracy)

# Evaluate the model using a confusion matrix
confusion_mat = confusion_matrix(y_test, y_pred)
print("Confusion Matrix: \n", confusion_mat)

Accuracy:  0.9833333333333333
Confusion Matrix:
 [[78  0]
 [ 3 99]]

In [27]:
y_pred

array(['No', 'No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'No', 'No',
       'No', 'No', 'No', 'Yes', 'Yes', 'Yes', 'No', 'No', 'No', 'No',
       'Yes', 'Yes', 'No', 'Yes', 'Yes', 'Yes', 'No', 'Yes', 'Yes', 'Yes',
       'No', 'No', 'Yes', 'No', 'Yes', 'No', 'Yes', 'No', 'Yes', 'No',
       'Yes', 'No', 'No', 'Yes', 'No', 'Yes', 'Yes', 'Yes', 'Yes', 'Yes',
       'Yes', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes', 'No', 'No',
       'No', 'Yes', 'Yes', 'No', 'Yes', 'Yes', 'Yes', 'No', 'No', 'No',
       'No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'No', 'No', 'Yes',
       'Yes', 'No', 'No', 'Yes', 'Yes', 'Yes', 'No', 'Yes', 'No', 'No',
       'Yes', 'Yes', 'No', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'Yes',
       'Yes', 'Yes', 'Yes', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes',
       'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes', 'Yes', 'No', 'No', 'Yes',
       'No', 'No', 'Yes', 'Yes', 'Yes', 'No', 'No', 'Yes', 'Yes', 'Yes',
       'Yes', 'No', 'Yes', 'Yes', 'Yes', 'No', 'Yes', 'Yes', 'Yes', 'No',
       'Yes', 'No', 'No', 'No', 'No', 'No', 'Yes', 'Yes', 'No', 'No',
       'Yes', 'No', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'Yes', 'Yes',
       'Yes', 'Yes', 'Yes', 'Yes', 'Yes', 'No', 'No', 'Yes', 'No', 'Yes',
       'Yes', 'No', 'No', 'Yes', 'Yes', 'Yes', 'Yes', 'No', 'Yes', 'Yes'],
      dtype=object)